
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.数据处理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3可视化分析.html" />
    
    
    <link rel="prev" href="数据接入.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    DataCF
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="数据接入.html">
            
                <a href="数据接入.html">
            
                    
                    1.数据接入
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="2数据处理.html">
            
                <a href="2数据处理.html">
            
                    
                    2.数据处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3可视化分析.html">
            
                <a href="3可视化分析.html">
            
                    
                    3.编辑图表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="图表类型.html">
            
                <a href="图表类型.html">
            
                    
                    > 图表类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="数据筛选.html">
            
                <a href="数据筛选.html">
            
                    
                    > 数据筛选
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="数据计算.html">
            
                <a href="数据计算.html">
            
                    
                    > 数据计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="图表格式.html">
            
                <a href="图表格式.html">
            
                    
                    > 图表格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="4报表展示.html">
            
                <a href="4报表展示.html">
            
                    
                    4.报表展示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="5账号权限.html">
            
                <a href="5账号权限.html">
            
                    
                    5.账号权限
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="用户授权管理.html">
            
                <a href="用户授权管理.html">
            
                    
                    > 用户授权管理
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >2.数据处理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x5B57;&#x6BB5;&#x7C7B;&#x578B;"><strong>&#x5B57;&#x6BB5;&#x7C7B;&#x578B;</strong></h4>
<hr>
<p>&#x6570;&#x636E;&#x914D;&#x65B9;&#x5DE5;&#x4F5C;&#x8868;&#x5185;&#xFF0C;&#x63D0;&#x4F9B;&#x7684;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x4E3B;&#x8981;&#x6709;&#x4E09;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x65E5;&#x671F;&#xFF08;&#x65F6;&#x95F4;&#xFF09;</li>
<li>&#x6587;&#x672C;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#xFF09;</li>
<li>&#x6570;&#x503C;</li>
</ul>
<p><strong>&#x65F6;&#x95F4;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#xFF08;date&#xFF09;</strong></p>
<p>&#x8868;&#x793A;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x662F;&#x65E5;&#x671F;&#x6216;&#x8005;&#x65F6;&#x95F4;&#xFF08;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x65F6;&#x95F4;&#x6233;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x5224;&#x65AD;&#x4E3A;&#x65F6;&#x95F4;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x5728;&#x5B57;&#x6BB5;&#x524D;&#x6807;&#x6CE8;&#x201C;D&#x201D;&#x7684;&#x56FE;&#x6807;&#x3002;&#x65F6;&#x95F4;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#x652F;&#x6301;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x56FE;&#x8868;&#x914D;&#x7F6E;&#x4E2D;&#x4E3B;&#x8981;&#x4F5C;&#x4E3A;&#x7EF4;&#x5EA6;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF08;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6570;&#x503C;&#xFF09;&#x3002;<br>&#x4E3E;&#x4F8B;&#xFF1A;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#x5747;&#x53EF;&#x4EE5;&#x88AB;&#x5224;&#x65AD;&#x4E3A;&#x65F6;&#x95F4;&#x7C7B;&#x578B;</p>
<pre><code> &quot;2017-01-01 0:00:00&quot;

 &quot;2017.01.01 0:00:00&quot;

 &quot;2017/01/01 0:00:00&quot;

 &quot;2017&#x5E74;1&#x6708;1&#x65E5;&quot;
</code></pre><p><strong>&#x6587;&#x672C;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#xFF08;text&#xFF09;</strong></p>
<p>&#x8868;&#x793A;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;string&#xFF0C;text&#x7B49;&#x5B57;&#x6BB5;&#x5224;&#x65AD;&#x4E3A;&#x6587;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E9B;&#x5730;&#x5740;&#xFF0C;&#x8BBE;&#x5907;&#x540D;&#x79F0;&#xFF0C;&#x7528;&#x6237;&#x540D;&#x7B49;&#xFF0C;&#x5E76;&#x5728;&#x5B57;&#x6BB5;&#x524D;&#x6807;&#x6CE8;&#x201C;T&#x201D;&#x7684;&#x56FE;&#x6807;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x56FE;&#x8868;&#x914D;&#x7F6E;&#x4E2D;&#x4F5C;&#x4E3A;&#x7EF4;&#x5EA6;&#x6216;&#x8005;&#x6570;&#x503C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#x3002;<br>&#x4E3E;&#x4F8B;&#xFF1A;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#x5747;&#x53EF;&#x4EE5;&#x88AB;&#x5224;&#x65AD;&#x4E3A;&#x6587;&#x672C;&#x7C7B;&#x578B;</p>
<pre><code>&#x201D;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x201C;   

 &#x201D;This is paper&#x201C;  

 &#x201D;DC-12345&#x201C;  

 &#x201D;1094*324&#x201C;  

 &#x201D;168.192.1.1&#x201C;
</code></pre><p><strong>&#x6570;&#x503C;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#xFF08;num&#xFF09;</strong></p>
<p>&#x8868;&#x793A;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x6216;&#x8005;&#x6570;&#x5B57;&#x3002;&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;int&#xFF0C;double&#xFF0C;numeric&#x7B49;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x5224;&#x65AD;&#x4E3A;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#x4E00;&#x4E9B;&#x5145;&#x503C;&#x91D1;&#x989D;&#xFF0C;&#x5929;&#x6C14;&#x6E29;&#x5EA6;&#x7B49;&#xFF0C;&#x5E76;&#x5728;&#x5B57;&#x6BB5;&#x524D;&#x6807;&#x6CE8;&#x201C;N&#x201D;&#x7684;&#x56FE;&#x6807;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x56FE;&#x8868;&#x914D;&#x7F6E;&#x4E2D;&#x4F5C;&#x4E3A;&#x7EF4;&#x5EA6;&#x6216;&#x8005;&#x6570;&#x503C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#x3002;<br>&#x4E3E;&#x4F8B;&#xFF1A;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#x5747;&#x53EF;&#x4EE5;&#x88AB;&#x5224;&#x65AD;&#x4E3A;&#x6570;&#x503C;&#x7C7B;&#x578B;</p>
<pre><code> &#x201D;124.1&#x201C;  

 &#x201D;-12&#x201C;  

 &#x201D;143253462&#x201C;  

 &#x201D;89%&#x201C;
</code></pre><p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&quot;1490753296&quot;&#xFF0C;&#x65F6;&#x95F4;&#x6233;&#x9ED8;&#x8BA4;&#x8BC6;&#x522B;&#x4E3A;&#x6574;&#x578B;&#xFF08;&#x5373;&#x6570;&#x503C;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x540E;&#x53F0;&#x8BBE;&#x7F6E;&#x5C06;&#x65F6;&#x95F4;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x8F6C;&#x5230;&#x201D;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x201C;&#x9875;&#x9762;&#xFF1A;<br><img src="assets/&#x65F6;&#x95F4;&#x6233;&#x8F6C;&#x5316;.png" alt=""></p>
<p><strong>&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;</strong></p>
<p>&#x5728;&#x4EA7;&#x54C1;&#x5206;&#x6790;&#x6216;&#x8005;&#x76F8;&#x5173;&#x4F01;&#x4E1A;&#x6570;&#x636E;&#x5BA1;&#x6838;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x8BA1;&#x7B97;&#x6307;&#x6807;&#x3002;&#x6570;&#x636E;&#x914D;&#x65B9;&#x63D0;&#x4F9B;&#x4E86;&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x652F;&#x6301;&#x5229;&#x7528;&#x51E0;&#x5341;&#x79CD;&#x7684;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x9700;&#x8981;&#x7684;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li>&#x786E;&#x5B9A;&#x6307;&#x6807;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x9009;&#x62E9;&#x6307;&#x5B9A;&#x5DE5;&#x4F5C;&#x8868;&#xFF1B;</li>
<li>&#x6DFB;&#x52A0;&#x6307;&#x6807;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x8868;&#x6570;&#x636E;&#x9884;&#x89C8;Tab&#x4E0B;&#xFF0C;&#x70B9;&#x51FB;&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;&#xFF0C;&#x8BBE;&#x7F6E;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#xFF0C;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x3002;&#x7528;&#x6237;&#x5728;&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x5224;&#x65AD;&#x516C;&#x5F0F;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x5E76;&#x63D0;&#x793A;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</li>
<li>&#x68C0;&#x6D4B;&#x6DFB;&#x52A0;&#x5B57;&#x6BB5;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;
&#x6DFB;&#x52A0;&#x7684;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;&#x751F;&#x6210;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x5DE5;&#x4F5C;&#x8868;&#x7684;&#x6570;&#x636E;&#x9884;&#x89C8;&#x9875;&#x9762;&#x627E;&#x5230;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x68C0;&#x9A8C;&#x5B57;&#x6BB5;&#x503C;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x7B26;&#x5408;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p><img src="assets/&#x6DFB;&#x52A0;&#x8BA1;&#x7B97;&#x5B57;&#x6BB5;.png" alt=""></p>
<p>(&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#x5904;&#x7406;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x548C;&#x7528;&#x4F8B;&#x3002;)</p>
<h4 id="&#x521B;&#x5EFA;&#x5173;&#x8054;&#x8868;"><strong>&#x521B;&#x5EFA;&#x5173;&#x8054;&#x8868;</strong></h4>
<hr>
<p><strong><em>{&#x4F55;&#x4E3A;&#x5173;&#x8054;&#xFF0C;&#x8BA2;&#x5355;&#x6570;&#x636E;&#x4E2D;&#x4E00;&#x822C;&#x53EA;&#x5B58;&#x53D6;&#x4E86;&#x7528;&#x6237;&#x7684;ID&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x7528;&#x6237;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5206;&#x6790;&#x5546;&#x54C1;&#x7684;&#x7528;&#x6237;&#x753B;&#x50CF;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;&#x8BA2;&#x5355;&#x8868;&#x548C;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x8868;&#x501F;&#x52A9;&#x4E24;&#x8868;&#x5171;&#x6709;&#x7684;&#x7528;&#x6237;id&#x53EF;&#x6C47;&#x603B;&#x6210;&#x4E00;&#x5F20;&#x65B0;&#x8868;&#xFF0C;&#x5BF9;&#x8FD9;&#x5F20;&#x65B0;&#x8868;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x5546;&#x54C1;&#x7684;&#x7528;&#x6237;&#x753B;&#x50CF;&#x3002;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x5173;&#x8054;}</em></strong></p>
<p>DataCF&#x7684;&#x5173;&#x8054;&#x652F;&#x6301;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x8054;&#x5408;&#x8868;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x4E00;&#x5BF9;&#x591A;&#x8868;&#x7684;&#x5173;&#x8054;&#x5408;&#x8868;&#x3002;&#x5173;&#x8054;&#x652F;&#x6301;&#x4E09;&#x79CD;&#x5F62;&#x5F0F;&#xFF1A;</p>
<ul>
<li>Left join&#xFF1A;&#x5DE6;&#x5173;&#x8054;&#xFF0C;&#x8868;&#x793A;&#x4EE5;&#x5DE6;&#x8868;&#x4E3A;&#x4E3B;&#x8868;&#x8FDB;&#x884C;&#x5173;&#x8054;&#x64CD;&#x4F5C;&#x3002;&#x663E;&#x793A;&#x5DE6;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;,&#x4E0D;&#x7BA1;&#x662F;&#x5426;&#x4E0E;&#x5173;&#x8054;&#x6761;&#x4EF6;&#x76F8;&#x5339;&#x914D;,&#x800C;&#x53F3;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x53EA;&#x663E;&#x793A;&#x4E0E;&#x5173;&#x8054;&#x6761;&#x4EF6;&#x76F8;&#x5339;&#x914D;&#x7684;&#x8BB0;&#x5F55;&#xFF1B;</li>
<li>Inner join&#xFF1A;&#x7B49;&#x503C;&#x5173;&#x8054;&#xFF0C;&#x8868;&#x793A;&#x5BF9;&#x4E24;&#x8868;&#x53D6;&#x4EA4;&#x96C6;&#xFF0C;&#x53EA;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x8868;&#x4E2D;&#x8054;&#x7ED3;&#x5B57;&#x6BB5;&#x76F8;&#x7B49;&#x7684;&#x884C;&#xFF1B;</li>
<li>Full join&#xFF1A;&#x5168;&#x5173;&#x8054;&#xFF0C;&#x8868;&#x793A;&#x5BF9;&#x4E24;&#x8868;&#x53D6;&#x5E76;&#x96C6;&#x3002;&#x8FD4;&#x56DE;&#x4E24;&#x8868;&#x4E2D;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x5426;&#x5339;&#x914D;&#x3002;</li>
</ul>
<p>&#x521B;&#x5EFA;&#x5173;&#x8054;&#x8868;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li>&#x8FDB;&#x5165;&#x521B;&#x5EFA;&#x5173;&#x8054;&#x8868;&#x7684;&#x64CD;&#x4F5C;&#x9875;&#x9762;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x8868;&#x6570;&#x636E;&#x9884;&#x89C8;&#x9875;&#x9762;&#xFF0C;&#x70B9;&#x51FB;&#x9875;&#x9762;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x521B;&#x5EFA;&#x5173;&#x8054;&#x8868;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x9875;&#x9762;&#x3002;</li>
<li><p>&#x9009;&#x62E9;&#x5173;&#x8054;&#x7684;&#x8868;&#xFF0C;&#x5173;&#x8054;&#x65B9;&#x5F0F;&#x548C;&#x5173;&#x8054;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x3002;&#x9009;&#x62E9;&#x9875;&#x9762;&#x5DE6;&#x4FA7;&#x9700;&#x8981;&#x5173;&#x8054;&#x7684;&#x5DE5;&#x4F5C;&#x8868;&#xFF0C;&#x5C06;&#x5176;&#x62D6;&#x62FD;&#x5230;&#x53F3;&#x4FA7;&#x5DE5;&#x4F5C;&#x533A;&#xFF0C;&#x8C03;&#x6574;&#x8BBE;&#x7F6E;&#x9700;&#x8981;&#x663E;&#x793A;&#x7684;&#x5173;&#x8054;&#x8868;&#x7684;&#x5B57;&#x6BB5;&#x5185;&#x5BB9;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x65B0;&#x751F;&#x6210;&#x7684;&#x5173;&#x8054;&#x8868;&#x8FDB;&#x884C;&#x547D;&#x540D;&#x4EE5;&#x53CA;&#x4FDD;&#x5B58;&#x3002;</p>
</li>
</ol>
<p><img src="assets/&#x5173;&#x8054;&#x8868;&#x8BA1;&#x7B97;.png" alt=""></p>
<h4 id="&#x5DE5;&#x4F5C;&#x8868;&#x7BA1;&#x7406;"><strong>&#x5DE5;&#x4F5C;&#x8868;&#x7BA1;&#x7406;</strong></h4>
<hr>
<p><strong>&#x6570;&#x636E;&#x9884;&#x89C8;</strong></p>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x5236;&#x7EDF;&#x8BA1;&#x4E0B;&#xFF0C;&#x5DE5;&#x4F5C;&#x5217;&#x8868;&#x9875;&#x9009;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x5DE5;&#x4F5C;&#x8868;&#x8FDB;&#x884C;&#x9884;&#x89C8;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x8868;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#xFF0C;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#xFF0C;&#x5B57;&#x6BB5;&#x503C;&#xFF0C;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x9884;&#x89C8;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x67E5;&#x770B;&#x3002;</p>
<p><img src="assets/&#x6570;&#x636E;&#x9884;&#x89C8;.png" alt=""></p>
<p>&#x5982;&#x679C;&#x89C9;&#x5F97;&#x8868;&#x4E2D;&#x5B57;&#x6BB5;&#x8FC7;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BBE;&#x7F6E;&#x663E;&#x793A;&#x5B57;&#x6BB5;&#x6765;&#x9009;&#x62E9;&#x663E;&#x793A;&#x9700;&#x8981;&#x7684;&#x5B57;&#x6BB5;&#x3002;</p>
<p><img src="assets/&#x5B57;&#x6BB5;&#x7B5B;&#x9009;.png" alt=""></p>
<p><strong>&#x5173;&#x8054;&#x6982;&#x51B5;</strong></p>
<p>&#x4E00;&#x5F20;&#x5DE5;&#x4F5C;&#x8868;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x8868;&#xFF0C;&#x5728;&#x5173;&#x8054;&#x6982;&#x51B5;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x652F;&#x6301;&#x67E5;&#x770B;&#x6B64;&#x5DE5;&#x4F5C;&#x8868;&#x5173;&#x8054;&#x914D;&#x7F6E;&#x7684;&#x6240;&#x6709;&#x7684;&#x56FE;&#x8868;&#x4FE1;&#x606F;&#x3002;&#x5E76;&#x80FD;&#x591F;&#x9009;&#x62E9;&#x7F16;&#x8F91;&#x6307;&#x5B9A;&#x7684;&#x56FE;&#x8868;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x5C06;&#x56FE;&#x8868;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x62A5;&#x8868;&#x4E2D;&#x3002;<br><img src="assets/&#x5173;&#x8054;&#x6982;&#x51B5;.png" alt=""></p>
<p><strong>&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;</strong></p>
<p>&#x4ECE;&#x4EA7;&#x54C1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x540C;&#x6B65;&#x5230;&#x6570;&#x636E;&#x914D;&#x65B9;&#x540E;&#xFF0C;&#x5B57;&#x6BB5;&#x540D;&#x9ED8;&#x8BA4;&#x662F;&#x548C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x540D;&#x79F0;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x53EA;&#x652F;&#x6301;&#x82F1;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x4F7F;&#x7528;&#x548C;&#x533A;&#x5206;&#x5B57;&#x6BB5;&#x3002;&#x5B9A;&#x5236;&#x7EDF;&#x8BA1;-&#x5DE5;&#x4F5C;&#x5217;&#x8868;&#x9875;&#x63D0;&#x4F9B;&#x4E86;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x529F;&#x80FD;&#xFF0C;&#x7528;&#x6237;&#x9009;&#x62E9;&#x60F3;&#x8981;&#x66F4;&#x6539;&#x7684;&#x5DE5;&#x4F5C;&#x8868;&#xFF0C;&#x70B9;&#x51FB;&#x201C;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x201D;&#xFF0C;&#x9009;&#x62E9;&#x9700;&#x8981;&#x66F4;&#x6539;&#x7684;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x7F16;&#x8F91;&#x3002;<img src="assets/&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;.png" alt=""></p>
<p><strong>&#x5DE5;&#x4F5C;&#x8868;&#x6587;&#x4EF6;&#x5939;&#x64CD;&#x4F5C;</strong></p>
<p>&#x5DE5;&#x4F5C;&#x8868;&#x5217;&#x8868;&#x9875;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x7BA1;&#x7406;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x5BF9;&#x591A;&#x4E2A;&#x5DE5;&#x4F5C;&#x8868;&#x53EF;&#x4EE5;&#x505A;&#x7EDF;&#x4E00;&#x7684;&#x5206;&#x7C7B;&#x7BA1;&#x7406;&#x3002;&#x6587;&#x4EF6;&#x5939;&#x652F;&#x6301;&#x91CD;&#x547D;&#x540D;&#xFF0C;&#x79FB;&#x52A8;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x3002;<br><img src="assets/wenjianjia.png" alt=""></p>
<p><strong>&#x5DE5;&#x4F5C;&#x8868;&#x7BA1;&#x7406;</strong></p>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5BF9;&#x81EA;&#x5DF1;&#x4E0A;&#x4F20;&#x7684;&#x6587;&#x4EF6;&#x5DE5;&#x4F5C;&#x8868;&#xFF0C;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x7684;&#x7BA1;&#x7406;&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="assets/&#x5DE5;&#x4F5C;&#x8868;&#x7BA1;&#x7406;.png" alt=""><img src="assets/&#x5DE5;&#x4F5C;&#x8868;&#x7BA1;&#x7406;1.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="数据接入.html" class="navigation navigation-prev " aria-label="Previous page: 1.数据接入">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3可视化分析.html" class="navigation navigation-next " aria-label="Next page: 3.编辑图表">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.数据处理","level":"1.3","depth":1,"next":{"title":"3.编辑图表","level":"1.4","depth":1,"path":"3可视化分析.md","ref":"3可视化分析.md","articles":[]},"previous":{"title":"1.数据接入","level":"1.2","depth":1,"path":"数据接入.md","ref":"数据接入.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2数据处理.md","mtime":"2017-03-31T03:03:41.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-05-05T01:22:22.341Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

