
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.编辑图表 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="图表类型.html" />
    
    
    <link rel="prev" href="2数据处理.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    DataCF
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="数据接入.html">
            
                <a href="数据接入.html">
            
                    
                    1.数据接入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2数据处理.html">
            
                <a href="2数据处理.html">
            
                    
                    2.数据处理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="3可视化分析.html">
            
                <a href="3可视化分析.html">
            
                    
                    3.编辑图表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="图表类型.html">
            
                <a href="图表类型.html">
            
                    
                    > 图表类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="数据筛选.html">
            
                <a href="数据筛选.html">
            
                    
                    > 数据筛选
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="数据计算.html">
            
                <a href="数据计算.html">
            
                    
                    > 数据计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="图表格式.html">
            
                <a href="图表格式.html">
            
                    
                    > 图表格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="4报表展示.html">
            
                <a href="4报表展示.html">
            
                    
                    4.报表展示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="5账号权限.html">
            
                <a href="5账号权限.html">
            
                    
                    5.账号权限
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="用户授权管理.html">
            
                <a href="用户授权管理.html">
            
                    
                    > 用户授权管理
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >3.编辑图表</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x5728;&#x8FDB;&#x5165;&#x56FE;&#x8868;&#x7F16;&#x8F91;&#x754C;&#x9762;&#x540E;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x5728;&#x5DE6;&#x4FA7;&#x5217;&#x8868;&#x4E2D;&#x9009;&#x62E9;&#x9700;&#x8981;&#x5206;&#x6790;&#x5B57;&#x6BB5;&#xFF0C;&#x5C06;&#x5176;&#x62D6;&#x62FD;&#x81F3;&#x7EF4;&#x5EA6;&#x3001;&#x6570;&#x503C;&#x3001;&#x5BF9;&#x6BD4;&#x3001;&#x7B5B;&#x9009;&#x5668;&#x3001;&#x989C;&#x8272;&#x7B49;&#x533A;&#x57DF;&#xFF0C;&#x5373;&#x53EF;&#x5F00;&#x59CB;&#x6570;&#x636E;&#x5206;&#x6790;&#x5DE5;&#x4F5C;&#x3002;</p>
<h4 id="&#x62D6;&#x62FD;&#x5206;&#x6790;"><strong>&#x62D6;&#x62FD;&#x5206;&#x6790;</strong></h4>
<hr>
<p>&#x5BF9;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x7684;&#x5B57;&#x6BB5;&#x62D6;&#x62FD;&#x7684;&#x7EF4;&#x5EA6;&#x548C;&#x6307;&#x6807;&#x533A;&#x57DF;&#xFF0C;&#x5373;&#x53EF;&#x7ED8;&#x5236;&#x51FA;&#x8868;&#x683C;</p>
<p><img src="assets/&#x62D6;&#x62FD;&#x5B57;&#x6BB5;.png" alt=""></p>
<p>&#x5982;&#x679C;&#x7B26;&#x5408;&#x7A81;&#x53D8;&#x66F4;&#x6362;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x53F3;&#x8FB9;&#x5DE5;&#x4F5C;&#x533A;&#x9009;&#x62E9;&#x66F4;&#x6362;&#x6210;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x56FE;&#x8868;&#xFF0C;&#x786E;&#x5B9A;&#x540E;&#xFF0C;&#x5373;&#x53EF;&#x4FDD;&#x5B58;&#x56FE;&#x8868;&#x5185;&#x5BB9;&#x3002;</p>
<p><img src="assets/&#x66F4;&#x6362;&#x56FE;&#x8868;&#x7C7B;&#x578B;.png" alt=""></p>
<p><img src="assets/&#x66F4;&#x6362;&#x56FE;&#x8868;&#x7C7B;&#x578B;1.png" alt=""></p>
<p>&#x589E;&#x52A0;&#x7EF4;&#x5EA6;&#x5BF9;&#x6BD4;&#xFF0C;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x6BB5;&#x62D6;&#x62FD;&#x5230;&#x6B64;&#x533A;&#x57DF;&#xFF0C;&#x5C55;&#x793A;&#x66F4;&#x7EC6;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x3002;</p>
<p><img src="assets/&#x589E;&#x52A0;&#x7EF4;&#x5EA6;&#x5BF9;&#x6BD4;.png" alt=""></p>
<p>&#x6570;&#x636E;&#x7B5B;&#x9009;&#xFF1A;&#x53EF;&#x4EE5;&#x5C06;&#x5B57;&#x6BB5;&#x62D6;&#x5165;&#x5230;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7B5B;&#x9009;&#x3002;</p>
<p><img src="assets/&#x6570;&#x636E;&#x7B5B;&#x9009;.png" alt=""></p>
<h4 id="&#x7EF4;&#x5EA6;&#x3001;&#x5BF9;&#x6BD4;&#x548C;&#x6570;&#x503C;"><strong>&#x7EF4;&#x5EA6;&#x3001;&#x5BF9;&#x6BD4;&#x548C;&#x6570;&#x503C;</strong></h4>
<hr>
<h5 id="&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x57FA;&#x672C;&#x6982;&#x5FF5;</h5>
<p>&#x7EF4;&#x5EA6;&#x3001;&#x5BF9;&#x6BD4;&#x3001;&#x6570;&#x503C;&#x662F;&#x6784;&#x6210;&#x5206;&#x6790;&#x56FE;&#x8868;&#x7684;&#x57FA;&#x7840;&#x5143;&#x7D20;&#xFF0C;&#x6570;&#x503C;&#x6839;&#x636E;&#x7EF4;&#x5EA6;&#x548C;&#x5BF9;&#x6BD4;&#x7684;&#x8BBE;&#x7F6E;&#x8FDB;&#x884C;&#x6C47;&#x603B;&#x8BA1;&#x7B97;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x8F6C;&#x6362;&#x4E3A;&#x53EF;&#x89C6;&#x5316;&#x56FE;&#x8868;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4EE5;&#x5206;&#x6790;&#x67D0;&#x4E2A;&#x6E38;&#x620F;&#x7528;&#x6237;&#x767B;&#x5F55;&#x6570;&#x636E;&#x5206;&#x6790;&#x4F5C;&#x4E3A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E09;&#x4E2A;&#x57FA;&#x7840;&#x5143;&#x7D20;&#x7684;&#x6982;&#x5FF5;&#x3002;
&#x5047;&#x8BBE;&#x7B2C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x201C;&#x67E5;&#x770B;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x73A9;&#x5BB6;&#x7684;&#x5E73;&#x5747;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#x201D;&#x3002;
&#x201C;&#x73A9;&#x5BB6;&#x7684;&#x5E73;&#x5747;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#x201D;&#x5373;&#x662F;&#x6570;&#x503C;&#xFF0C;&#x7C7B;&#x4F3C;&#x7684;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6570;&#x503C;&#x7684;&#x8FD8;&#x6709;&#xFF0C;&#x201C;&#x767B;&#x5F55;&#x4EBA;&#x6570;&#x201D;&#xFF0C;&#x201C;&#x767B;&#x5F55;&#x6B21;&#x6570;&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6240;&#x67E5;&#x770B;&#x7684;&#x6570;&#x503C;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5C31;&#x662F;&#x7EF4;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x76EE;&#x6807;&#x91CC;&#x9762;&#x7684;&#x201C;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x201D;&#x5C31;&#x662F;&#x4F5C;&#x4E3A;&#x67E5;&#x770B;&#x7684;&#x7C7B;&#x522B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C06;&#x201C;&#x5E73;&#x53F0;&#x201D;&#x5B57;&#x6BB5;&#x62D6;&#x62FD;&#x5230;&#x201C;&#x7EF4;&#x5EA6;&#x201D;&#x533A;&#x57DF;&#xFF0C;&#x5C06;&#x201C;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#x201D;&#x62D6;&#x62FD;&#x5230;&#x201C;&#x6570;&#x503C;&#x201D;&#x533A;&#x57DF;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x5217;&#x8868;&#x683C;&#xFF1A;
<img src="assets/&#x7EF4;&#x5EA6;1.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x4F4D;&#x4E8E;&#x6570;&#x503C;&#x7684;&#x201C;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#x201D;&#x5B57;&#x6BB5;&#x663E;&#x793A;&#x7740;&#x201C;AVG&#xFF08;&#x6C42;&#x5E73;&#x5747;&#x503C;&#xFF09;&#x201D;&#xFF0C;&#x8FD9;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x7684;&#x805A;&#x5408;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x5207;&#x6362;&#x805A;&#x5408;&#x65B9;&#x5F0F;&#x4E3A;&#x201C;&#x6C42;&#x548C;&#x201D;&#x3001;&#x201C;&#x8BA1;&#x6570;&#x201D;&#x3001;&#x201C;&#x53BB;&#x91CD;&#x8BA1;&#x6570;&#x201D;&#x3001;&#x201C;&#x6700;&#x5927;&#x503C;&#x201D;&#x3001;&#x201C;&#x6700;&#x5C0F;&#x503C;&#x201D;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x56FE;&#x4E3A;&#x4F8B;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x6309;&#x7167;&#x6E38;&#x620F;&#x767B;&#x5F55;&#x5E73;&#x53F0;&#xFF0C;&#x76F8;&#x540C;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x201C;&#x767B;&#x5F55;&#x201D;&#x4F1A;&#x88AB;&#x5408;&#x5E76;&#x4F5C;&#x4E3A;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x201C;&#x805A;&#x5408;&#x503C;&#x201D;&#x3002;</p>
<p>&#x5728;&#x6570;&#x636E;&#x914D;&#x65B9;&#x4E2D;&#xFF0C;&#x82E5;&#x60A8;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x67D0;&#x4E9B;&#x7EF4;&#x5EA6;&#x5C06;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x56FE;&#x5F62;&#x7EC6;&#x5206;&#x5230;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#xFF0C;&#x5E76;&#x91CD;&#x70B9;&#x5BF9;&#x6BD4;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E2D;&#x7684;&#x6BCF;&#x9879;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x636E;&#x62D6;&#x62FD;&#x5230;&#x201C;&#x5BF9;&#x6BD4;&#x201D;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5728;&#x4E0A;&#x56FE;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x82E5;&#x5E0C;&#x671B;&#x67E5;&#x770B;&#x6BCF;&#x4E00;&#x5929;&#xFF0C;&#x4ED4;&#x7EC6;&#x5BF9;&#x6BD4;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x7684;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x201C;&#x65E5;&#x671F;&#x201D;&#x62D6;&#x62FD;&#x5230;&#x201C;&#x5BF9;&#x6BD4;&#x201D;&#x533A;&#x57DF;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x8868;
<img src="assets/&#x7EF4;&#x5EA6;2.png" alt="">
<img src="assets/&#x7EF4;&#x5EA6;3.png" alt="">
&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x53BB;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56FE;&#x8868;&#x4E0B;&#x65B9;&#x7684;&#x56FE;&#x4F8B;&#x67E5;&#x770B;&#x6BCF;&#x79CD;&#x989C;&#x8272;&#x4EE3;&#x8868;&#x7684;&#x65E5;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x5BF9;&#x6BD4;&#x6BCF;&#x4E00;&#x5929;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x975E;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BA1;&#x6570;&#x548C;&#x53BB;&#x91CD;&#x8BA1;&#x6570;&#x7684;&#x805A;&#x5408;&#x65B9;&#x5F0F;&#x5F97;&#x5230;&#x6570;&#x503C;&#x7ED3;&#x679C;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x3002;
&#x4F8B;&#x5982;&#xFF0C;&#x521A;&#x521A;&#x63D0;&#x5230;&#x7684;&#x67E5;&#x770B;&#x6BCF;&#x4E00;&#x5929;&#x7684;&#x767B;&#x5F55;&#x8BA4;&#x8BC6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x201C;&#x65E5;&#x671F;&#x201D;&#x62D6;&#x62FD;&#x5230;&#x7EF4;&#x5EA6;&#x533A;&#x57DF;&#xFF0C;&#x5E76;&#x5C06;&#x201C;&#x89D2;&#x8272;ID&#x201D;&#x62D6;&#x62FD;&#x5230;&#x6570;&#x503C;&#x533A;&#x57DF;&#xFF0C;&#x5C06;&#x89D2;&#x8272;ID&#x7684;&#x805A;&#x5408;&#x65B9;&#x5F0F;&#xFF0C;&#x5207;&#x6362;&#x4E3A;&#x201C;&#x53BB;&#x91CD;&#x8BA1;&#x6570;&#x201D;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x5217;&#x56FE;&#x8868;&#xFF1A;
<img src="assets/&#x7EF4;&#x5EA6;4.png" alt=""></p>
<h5 id="&#x5B57;&#x6BB5;&#x64CD;&#x4F5C;">&#x5B57;&#x6BB5;&#x64CD;&#x4F5C;</h5>
<p>&#x88AB;&#x62D6;&#x62FD;&#x5230;&#x7EF4;&#x5EA6;&#xFF0C;&#x5BF9;&#x6BD4;&#x548C;&#x6570;&#x503C;&#x533A;&#x57DF;&#x7684;&#x6570;&#x636E;&#x652F;&#x6301;&#x5404;&#x7C7B;&#x64CD;&#x4F5C;&#x3002;&#x901A;&#x8FC7;&#x70B9;&#x51FB;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x4E0B;&#x62C9;&#x7BAD;&#x5934;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x6240;&#x6709;&#x652F;&#x6301;&#x7684;&#x64CD;&#x4F5C;&#x3002;
&#x5BF9;&#x4E8E;&#x7EF4;&#x5EA6;&#x5B57;&#x6BB5;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x8BBE;&#x7F6E;&#x522B;&#x540D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C;&#x65B9;&#x4FBF;&#x81EA;&#x5DF1;&#x6216;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x66F4;&#x6E05;&#x6670;&#x5730;&#x7406;&#x89E3;&#x6B64;&#x5B57;&#x6BB5;&#x7684;&#x542B;&#x4E49;&#x3002;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#x548C;&#x5BF9;&#x6BD4;&#x5747;&#x652F;&#x6301;&#x6392;&#x5E8F;&#x64CD;&#x4F5C;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5347;&#x5E8F;&#x3001;&#x964D;&#x5E8F;&#x3001;&#x9ED8;&#x8BA4;&#x987A;&#x5E8F;&#x3002;
<img src="assets/&#x7EF4;&#x5EA6;5.png" alt=""></p>
<p>&#x6570;&#x503C;&#x5B57;&#x6BB5;&#x652F;&#x6301;&#x7684;&#x64CD;&#x4F5C;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x3002;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x4E0D;&#x540C;&#x7684;&#x805A;&#x5408;&#x7C7B;&#x578B;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x6570;&#x503C;&#x4E0A;&#x5E94;&#x7528;&#x5404;&#x7C7B;&#x5E38;&#x7528;&#x7684;&#x9AD8;&#x7EA7;&#x8BA1;&#x7B97;&#xFF0C;&#x4E0B;&#x6587;&#x4F1A;&#x63D0;&#x4F9B;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x4E0E;&#x7EF4;&#x5EA6;&#x5B57;&#x6BB5;&#x7C7B;&#x4F3C;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x6570;&#x503C;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3001;&#x522B;&#x540D;&#x3001;&#x5355;&#x4F4D;&#x548C;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C;&#x8BA9;&#x6570;&#x636E;&#x4EE5;&#x6700;&#x5408;&#x9002;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5C55;&#x793A;&#x548C;&#x89E3;&#x91CA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x6570;&#x503C;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x6570;&#x503C;&#x5B57;&#x6BB5;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7ED3;&#x679C;&#x7B5B;&#x9009;&#xFF0C;&#x5373;&#x5728;&#x83B7;&#x5F97;&#x6570;&#x636E;&#x7ED3;&#x679C;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5E94;&#x7528;&#x7B5B;&#x9009;&#x6761;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8868;&#x4E2D;&#x8FDB;&#x884C;&#x7B5B;&#x9009;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x6587;&#x4E2D;&#x627E;&#x5230;&#x5173;&#x4E8E;&#x7B5B;&#x9009;&#x7684;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;
<img src="assets/&#x7EF4;&#x5EA6;6.png" alt=""></p>
<h5 id="&#x65E5;&#x671F;&#x7EF4;&#x5EA6;">&#x65E5;&#x671F;&#x7EF4;&#x5EA6;</h5>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x66F4;&#x65B9;&#x4FBF;&#x5730;&#x5206;&#x6790;&#x4E0E;&#x65E5;&#x671F;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x914D;&#x65B9;&#x4E2D;&#x7684;&#x65E5;&#x671F;&#x7EF4;&#x5EA6;&#x9664;&#x4E86;&#x62E5;&#x6709;&#x4E0E;&#x5176;&#x4ED6;&#x7EF4;&#x5EA6;&#x76F8;&#x540C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x8FD8;&#x652F;&#x6301;&#x4E0D;&#x540C;&#x65E5;&#x671F;&#x7C92;&#x5EA6;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x548C;&#x65E5;&#x671F;&#x805A;&#x5408;&#x5468;&#x671F;&#x7684;&#x8BBE;&#x7F6E;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x82E5;&#x5C06;&#x201C;&#x65E5;&#x671F;&#x201D;&#x5B57;&#x6BB5;&#x62D6;&#x62FD;&#x5230;&#x7EF4;&#x5EA6;&#x533A;&#x57DF;&#xFF0C;&#x5C06;&#x201C;&#x767B;&#x5F55;&#x7B49;&#x7EA7;&#x201D;&#x62D6;&#x62FD;&#x5230;&#x6570;&#x503C;&#x533A;&#x57DF;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x8BA2;&#x5355;&#x65E5;&#x671F;&#x7684;&#x7C92;&#x5EA6;&#x4E3A;&#x5E74;&#x3001;&#x6708;&#x3001;&#x5468;&#x3001;&#x65E5;&#x3001;&#x65F6;&#x3001;&#x5206;&#x3001;&#x79D2;&#x7B49;
<img src="assets/&#x7EF4;&#x5EA6;7.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2数据处理.html" class="navigation navigation-prev " aria-label="Previous page: 2.数据处理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="图表类型.html" class="navigation navigation-next " aria-label="Next page: > 图表类型">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.编辑图表","level":"1.4","depth":1,"next":{"title":"> 图表类型","level":"1.5","depth":1,"path":"图表类型.md","ref":"图表类型.md","articles":[]},"previous":{"title":"2.数据处理","level":"1.3","depth":1,"path":"2数据处理.md","ref":"2数据处理.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3可视化分析.md","mtime":"2017-03-29T07:50:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-05-05T01:22:22.341Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

